[
    {
            "name": "Dreadnaught",
            "description": "Fighter/Pole user, heavy focus in PvE content by taking on large groups of mobs at the same time.\n Can be used as a \"meat shield\" in PvP, while making use of his AOE stuns.",
            "pros": "Good farmer, can help boost others, overall tanky",
            "cons": "Not much damage in PvP, slow, if stun is resisted, provides little value",
            "race": "Humans",
            "starterClassName": "Fighter",
            "firstClassName": "Warrior",
            "secondClassName": "Dreadnaught",
            "thirdClassName": "Warlord"
        },
        {
            "name": "Gladiator",

            "race":             "Humans",
            "description": "Fighter/Dual-Sword user, a mixture of decent PvE and Strong PvP,\n scales well into the later stages of the game, \ngood coverage of ranged and melee attacks, resistances, and HP/CP pool.",
            "pros":             "Great 1vs1 potential, has ranged attacks to deal with threats from afar, great overall \"bulk\".",
            "cons":             "Relatively expensive to gear up, rough leveling experience.",
            "starterClassName": "Fighter",
            "firstClassName":   "Warrior",
            "secondClassName":  "Gladiator",
            "thirdClassName":   "Duelist"


        },
        {
            "name": "Paladin",
            "description": "Tank/Sword&Shield user, with extremely high defenses and HP pool,\n with a focus on side-heals and keeping threats away from the rest of the group.",
            "pros":             "Arguably the bulkiest tank in the game, with decent sudo-heal capability and CC potential.",
            "cons":             "Rough leveling experience due to lack of damage, doesn't bring much utility to a flight due to being overall slow.",
            "race":             "Humans",
            "starterClassName": "Fighter",
            "firstClassName":   "Knight",
            "secondClassName":  "Paladin",
            "thirdClassName":   "Phoenix Knight"
        },
        {
            "name":             "Dark Avenger",
            "description":      "Tank/Sword&Shield user, has the use of a panther pet that can deal decent damage, has a mixture of stuns and debuffs.",
            "pros":             "Panther can deal decent damage in a group environment, great 1vs1 due to being tanky and having the pet.",
            "cons":             "Panther can be expensive when you are just getting started, steals XP from you which makes your leveling a bit slower.",
            "race":             "Humans",
            "starterClassName": "Fighter",
            "firstClassName":   "Knight",
            "secondClassName":  "Dark Avenger",
            "thirdClassName":   "Hell Knight"
        },
        {
            "name":             "Treasure Hunter",
            "description":      "Assassin/Dagger user, has great mobility, decent HP pool, and can Lethal Strike for a quick kill.",
            "pros":             "High speed due to Dash skill, can open chests for the chance of extra Adena/enchants, \nif backstab procs Lethal it can end fights extremely quick.",
            "cons":             "Very dependent on the chance landing critical/lethal strikes, \ncant reliably use backstab until later on due to being very easy to turn around and avoid the skill that way, overall slow leveling.",
            "race":             "Humans",
            "starterClassName": "Fighter",
            "firstClassName":   "Rogue",
            "secondClassName":  "Treasure Hunter",
            "thirdClassName":   "Adventurer"
        },
        {
            "name":             "Hawkeye",
            "description":      "Archer/Bow user, has great mobility, decent HP pool, can do very reliable and constant damage with the chance for high critical hits.",
            "pros":             "High mobility lets him stay out of range of most threats, can survive a couple of hits due to decent HP pool, crits for high damage.",
            "cons":             "Extremely expensive leveling, the bow has a high consumption rate of SoulShots, needs to buy/craft arrows, overall very slow and expensive leveling experience.",
            "race":             "Humans",
            "starterClassName": "Fighter",
            "firstClassName":   "Rogue",
            "secondClassName":  "Hawkeye",
            "thirdClassName":   "Sagittarius"
        },
        {
            "name":             "Sorcerer",
            "description":      "Magic-user, has the most AOE ability of all mages, a decent amount of debuffs, overall OK stats all around.",
            "pros":             "Has a great time leveling up due to the high amount of AOE skills, kills fast, and doesn't require many resources, overall good for a first character.",
            "cons":             "Lack of strength in single target, lacks the high damage of the dark elf and the cast speed of the elf, \n can be considered \"jack of all trades, master of none\".",
            "race":             "Humans",
            "starterClassName": "Mystic",
            "firstClassName":   "Wizard",
            "secondClassName":  "Sorcerer",
            "thirdClassName":   "Archmage"
        },
        {
            "name":             "Necromancer",
            "description":      "Magic-user/Sudo-summoner, has access to a lot of debuffs and curses, decent damage in single target with a decent-to-good AOE ability.",
            "pros":             "Acess to a summon to reduce the amount of damage taken, has the ability to debuff/curse multiple targets due to AOE debuffs, decent damage overall.",
            "cons":             "Extremely rough early leveling experience, can be relatively expensive due to the need for resources to use his skills.",
            "race":             "Humans",
            "starterClassName": "Mystic",
            "firstClassName":   "Wizard",
            "secondClassName":  "Necromancer",
            "thirdClassName":   "SoulTaker"
        },
        {
            "name":             "Warlock",
            "description":      "Summoner, has access to pets that can aid in both attacking and buffing others, relatively cheap due to the fact of not needing much gear, \ncubics provide good support to the party, ability to summon party members to his location.",
            "pros":             "Easy class to play and learn, can be good both in solo and group content by using the summons, cheap to level since there's no need for gear.",
            "cons":             "Can be rendered useless once the pet is killed/erased, lack of overall damage outside of pet damage.",
            "race":             "Humans",
            "starterClassName": "Mystic",
            "firstClassName":   "Wizard",
            "secondClassName":  "Warlock",
            "thirdClassName":   "Arcana Lord"
        },
        {
            "name":             "Bishop",
            "description":      "Healer/Buffer, undoubtedly the best healer in the game, has access to a decent amount of buffs.",
            "pros":             "Unquestionably the best healer in the game, has access to decent buffs, can sleep enemies, and render them useless.",
            "cons":             "Extremely hard to level alone due to lack of damage against non-undead targets, can be tough to play due to being a very important part of every party.",
            "race":             "Humans",
            "starterClassName": "Mystic",
            "firstClassName":   "Cleric",
            "secondClassName":  "Bishop",
            "thirdClassName":   "Cardinal"
        },
        {
            "name":             "Prophet",
            "description":      "Buffer/Healer, has a very wide range of buffs and debuffs, can side heal when necessary.",
            "pros":             "Has access to the highest amount of buffs out of any support, great unique buffs for both melee/ranged/magic classes, can help to heal when needed.",
            "cons":             "Overall a slow leveling experience due to lack of damage, mana issues when buffing multiple people due to the need for buffing 1 by 1.",
            "race":             "Humans",
            "starterClassName": "Mystic",
            "firstClassName":   "Cleric",
            "secondClassName":  "Bishop",
            "thirdClassName":   "Cardinal"
        },
        {
            "name":             "Temple Knight",
            "description":      "Tank/Sword&Shield user, has access to cubics that can help the party by healing/damaging enemies, can sudo-heal.",
            "pros":             "Cubics provide an OK help to party members both in PvE and PvP, has access to strong heals, high evasion.",
            "cons":             "Low damage overall, slow leveling experience.",
            "race":             "Elfs",
            "starterClassName": "Fighter",
            "firstClassName":   "Knight",
            "secondClassName":  "Temple Knight",
            "thirdClassName":   "Eva´s Templar"
        },
        {
            "name":             "Swordsinger",
            "description":      "Support/Sudo-Tank, has access to songs that boost party members that are within a certain range of the cast, can help with tanking.",
            "pros":             "Amazing support provided with the songs, can boost both offensive and defensive abilities, has access to AOE and single-target debuffs. High defense, relatively easy to find parties for XP.",
            "cons":             "Lacks a lot of damage, a big gap between learning good buffs, slow leveling experience, can be relatively boring to play due to the style of the class.",
            "race":             "Elfs",
            "starterClassName": "Fighter",
            "firstClassName":   "Knight",
            "secondClassName":  "Swordsinger",
            "thirdClassName":   "SwordMuse"
        },
        {
            "name":             "Plains Walker",
            "description":      "Assassin/Dagger user, has high base speed and evasion, can open chests for extra loot, and has a decent heal. Can land a deadly blow to end fights quick.",
            "pros":             "High base stats, can sustain when farming alone due to having a decent heal for himself, if lucky with critical and deadly blows, fights end quickly.",
            "cons":             "Lack of overall damage, even when compared to other daggers, very reliant on the luck of skills, slow leveling experience.",
            "race":             "Elfs",
            "starterClassName": "Fighter",
            "firstClassName":   "Scout",
            "secondClassName":  "Plains Walker",
            "thirdClassName":   "Wind Rider"
        },
        {
            "name":             "Silver Ranger",
            "description":      "Archer/Bow user, has high base speed and can land critical shots for a respectable amount of damage.",
            "pros":             "High speed makes him great in open-world fights, access to a decent self-heal, and agro reset.",
            "cons":             "Lacks damaged compared to the other archer classes, very slow and expensive leveling experience.",
            "race":             "Elfs",
            "starterClassName": "Fighter",
            "firstClassName":   "Scout",
            "secondClassName":  "Silver Ranger",
            "thirdClassName":   "Moonlight Sentinel"
        },
        {
            "name":             "SpellSinger",
            "description":      "Magic-user, has access to decent AOE skills, debuffs, and single target nukes. High cast-speed.",
            "pros":             "Has the highest cast speed of all the mages, can deal significant damage in a prolonged fight, access to debuffs, and a high chance of canceling others attacks due to the number of casts it can do in a short period.",
            "cons":             "Lacks damaged compared to other mages, can burn mana very quickly due to casting a lot of spells, lack of self-healing/self mana regain skills.",
            "race":             "Elfs",
            "starterClassName": "Mystic",
            "firstClassName":   "Wizard",
            "secondClassName":  "SpellSinger",
            "thirdClassName":   "Mystic Muse"
        },
        {
            "name":             "Elemental Summoner",
            "description":      "Summoner, has access to pets that can fight or help others by buffing, has good AOE ability due to the summon, \ncubics provide good support to the party, ability to summon party members to his location.",
            "pros":             "Great AOE ability due to having a strong summon and a empower buff for it, relatively cheap and easy to play, fast leveling experience.",
            "cons":             "Can be very easily shut down by killing/erasing the summon, lack of utility in a melee party.",
            "race":             "Elfs",
            "starterClassName": "Mystic",
            "firstClassName":   "Wizard",
            "secondClassName":  "Elemental Summoner",
            "thirdClassName":   "Elemental Master"
        },
        {
            "name":             "Elven Elder",
            "description":      "Recharger/Buffer/Side-Healer, has access to recharging mana of other players, provides good buffs, can help on healing, has a wide variety of debuffs",
            "pros":             "Great partner to mages due to recharge and a wide variety of mage buffs, best healer after the bishop, can level up pretty fast even solo in the appropriate spots (undead mobs), strong in PvP due to the high casting speed/debuffs",
            "cons":             "Lacks fighter buffs, limited zones to level up due to being able to kill undead mobs only, high skill ceiling due to being super imperative in a PvP situation",
            "race":             "Elfs",
            "starterClassName": "Mystic",
            "firstClassName":   "Oracle",
            "secondClassName":  "Elven Elder",
            "thirdClassName":   "Eva´s Saint"
        },
        {
            "name":             "Shillen Knight",
            "description":      "Tank/Sword&Shield user, has access to cubics that can support the party or himself, high damage compared to other tanks, access to potent debuffs.",
            "pros":             "Cubics provide an OK benefit to the party, has access to a good amount of debuffs, high damaged compared to other tanks.",
            "cons":             "Low defensive stats when compared to other tanks, overall a bit of a slow leveling experience.",
            "race":             "DarkElfs",
            "starterClassName": "Fighter",
            "firstClassName":   "Knight",
            "secondClassName":  "Shillen Knight",
            "thirdClassName":   "Shillen Templar"
        },
        {
            "name":             "Blade Dancer",
            "description":      "Support/Dual-Sword user, has access to dances that provide buffs to party members that are within range, can do a respectable amount of damage, access to debuffs.",
            "pros":             "Great support provided by the dances, to both melee and mage party´s, can do a decent amount of damage, has access to a variety of debuffs, has no issues finding parties for XP.",
            "cons":             "Overall low defensive stats, expensive due to the need for dual-swords to cast his dances, can be boring due to play-style.",
            "race":             "DarkElfs",
            "starterClassName": "Fighter",
            "firstClassName":   "Knight",
            "secondClassName":  "Blade Dancer",
            "thirdClassName":   "Spectral Dancer"
        },
        {
            "name":             "Abyss Walker",
            "description":      "Assassin/Dagger user, can deal a high amount of damage even when not landing critical strikes, if Deadly blow procs it can end fights instantly, has access to the opening of chest and debuffs",
            "pros":             "Highest base damage of all daggers, can kill even when skills don't critically land, a deadly blow is a guaranteed one-shot, can open chest for extra resources, and has access to debuffs.",
            "cons":             "Low mobility and low defensive stats, can easily be eliminated before getting close to the target, somewhat dependent on skill luck, slow leveling experience.",
            "race":             "DarkElfs",
            "starterClassName": "Fighter",
            "firstClassName":   "Assassin",
            "secondClassName":  "Abyss Walker",
            "thirdClassName":   "Ghost Hunter"
        },
        {
            "name":             "Phantom Ranger",
            "description":      "Archer/Bow user, can deal a high amount of damage normally, can deal super high damage with critical shots, has access to debuffs.",
            "pros":             "High base damage, can deal significant damage even when not critically hitting, critical shots can one-shot robe users, has access to debuffs",
            "cons":             "Low mobility and HP pool, can easily be caught up to and killed by most melee, expensive and slow leveling process",
            "race":             "DarkElfs",
            "starterClassName": "Fighter",
            "firstClassName":   "Assassin",
            "secondClassName":  "Phantom Ranger",
            "thirdClassName":   "Ghost Sentinel"
        },
        {
            "name":             "SpellHowler",
            "description":      "Magic-user, has the highest base magic power of all mages, has access to self-healing and self mana regaining skills, great AOE, and single-target spells.",
            "pros":             "High damage, can quickly kill anyone if lucky with critical hits, great solo farmer due to self-healing and self mana regaining skills.",
            "cons":             "Low cast speed, lack of mobility, and debuffs.",
            "race":             "DarkElfs",
            "starterClassName": "Mystic",
            "firstClassName":   "Wizard",
            "secondClassName":  "SpellHowler",
            "thirdClassName":   "Storm Screamer"
        },
        {
            "name":             "Phantom Summoner",
            "description":      "Summoner, has access to single-target and Sudo-tanking pets, cubics provide good support to the party, can summon party members to his location.",
            "pros":             "High single target damage, can level up incredibly fast and cheap due to the summon having great stats and built-in life steal.",
            "cons":             "Provides little to nothing to a party outside of cubics, lacks AOE pet, and buffing pet.",
            "race":             "DarkElfs",
            "starterClassName": "Mystic",
            "firstClassName":   "Wizard",
            "secondClassName":  "Phantom Summoner",
            "thirdClassName":   "Spectral Summoner"
        },
        {
            "name":             "Shillen Oracle",
            "description":      "Recharger/Buffer/Healer, has access to the recharge spell, has great buffs both for melee and mage set-ups, can help with healing if needed.",
            "pros":             "Recharge makes it a great duo partner for any mage, has very useful buffs for both melee and mage player alike, fast leveling due to high demand, can help to heal.",
            "cons":             "Lack of damage for solo leveling, falls off later in the game due to not gaining many more buffs after a certain threshold.",
            "race":             "DarkElfs",
            "starterClassName": "Mystic",
            "firstClassName":   "Oracle",
            "secondClassName":  "Shillen Oracle",
            "thirdClassName":   "Shillen Elder"
        },
        {
            "name":             "Destroyer",
            "description":      "Fighter/Two-Handed Sword user, has incredible damage capability, very sought after for raids.",
            "pros":             "Best class for farming, has high offensive stats, gets more powerful the lower the HP, always wanted for raids, extremely fast leveling experience, easy to play, and learn.",
            "cons":             "Lacks mobility, can easily be kited/killed before getting to his target, lack of utility in PvP outside of the damage it provides.",
            "race":             "Orcs",
            "starterClassName": "Fighter",
            "firstClassName":   "Raider",
            "secondClassName":  "Destroyer",
            "thirdClassName":   "Titan"
        },
        {
            "name":             "Tyrant",
            "description":      "Fighter/Fists user, has high attack speed, access to a large pool of self buffs, can use ranged attacks.",
            "pros":             "High versability due to having access to a lot of self buffs, high attack speed making it a good damage dealer, can use ranged attacks, gets more powerful with lower HP",
            "cons":             "Expensive due to high shot consumption due to having high attack speed, not much utility outside of its damage.",
            "race":             "Orcs",
            "starterClassName": "Fighter",
            "firstClassName":   "Monk",
            "secondClassName":  "Tyrant",
            "thirdClassName":   "Grand Khavatari"
        },
        {
            "name":             "Overlord",
            "description":      "Buffer, can buff entire and entire clan and alliance at the same time, has great buffs for mage setups, can heal CP, and increase its amount.",
            "pros":             "Only class in the game that can increase and heal CP of others, can buff entire clans and alliances at the same time, great mage buffs.",
            "cons":             "Lack of damage, slow leveling experience, doesn't fit well in melee set-ups, can be boring due to play-style.",
            "race":             "Orcs",
            "starterClassName": "Mystic",
            "firstClassName":   "Shaman",
            "secondClassName":  "Overlord",
            "thirdClassName":   "Dominator"
        },
        {
            "name":             "Warcryer",
            "description":      "Buffer, can buff an entire party at the same time, has great buffs for a melee set up, can summon entire party´s to his location.",
            "pros":             "Can buff an entire party at the same time, has access to great buffs for a melee set up, can help side-healing, ability to summon the entire party to his location",
            "cons":             "Lack of damage, slow leveling experience, doesn't fit well in mage set-ups, can be boring due to play-style.",
            "race":             "Orcs",
            "starterClassName": "Mystic",
            "firstClassName":   "Shaman",
            "secondClassName":  "Warcryer",
            "thirdClassName":   "Doomcryer"
        },
        {
            "name":             "Warsmith",
            "description":      "Fighter, can craft materials and resources for others or himself, needed for late-game equipment crafting.",
            "pros":             "Ability to craft equipment and resources for himself or others, extremely needed later into the game due to being necessary to craft the equipment.",
            "cons":             "Extreme lack of damage, not useful in party environments, slow leveling experience, may be considered boring due to play-style.",
            "race":             "Dwarf",
            "starterClassName": "Fighter",
            "firstClassName":   "Artisan",
            "secondClassName":  "Warsmith",
            "thirdClassName":   "Maestro"
        },
        {
            "name":             "Bounty Hunter",
            "description":      "Fighter, can spoil monsters to obtain extra loot, needed for late-game material farming to crafting equipment.",
            "pros":             "Ability to generate extra income due to being able to obtain extra loot, extremely needed later into the game due to being necessary to obtain materials for equipment, easy to play.",
            "cons":             "Somewhat low damage, not very useful in party environments, slow leveling experience.",
            "race":             "Dwarf",
            "starterClassName": "Fighter",
            "firstClassName":   "Scavenger",
            "secondClassName":  "Bounty Hunter",
            "thirdClassName":   "Fortune Seeker"
        }
    ]
